#pragma once
//ライブラリ
#include "lib/gplib.h"

//ユーティリティ系
#include "lib/effect.h"
#include "lib/easing.h"
#include "lib/Gameover.h"
#include "lib/objectbase.h"
#include "lib/GameStart.h"

//======================================================================================//
//ステージ宣言
//======================================================================================//
#include "title.h"
#include "Meun.h"
#include "stage1.h"
#include "end.h"


//======================================================================================//
//関数記述
//======================================================================================//
//ステージ移行時に利用するステージの固有名
// --SCENEとして名前付けを行う
enum { TITLESCENE, MEUNSCENE, STAGE1SCENE, ENDSCENE };

//======================================================================================//
//関数定義
//======================================================================================//



